MikroElektronika/core_packages/PIC/XC8/def/PIC16C717/mcu.h
// Register: IOCB
#define IOCB IOCB
extern volatile unsigned char           IOCB                __at(0x096);
#ifndef _LIB_BUILD
asm("IOCB equ 096h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned IOCB0                  :1;
        unsigned IOCB1                  :1;
        unsigned IOCB2                  :1;
        unsigned IOCB3                  :1;
        unsigned IOCB4                  :1;
        unsigned IOCB5                  :1;
        unsigned IOCB6                  :1;
        unsigned IOCB7                  :1;
    };
} IOCBbits_t;
extern volatile IOCBbits_t IOCBbits __at(0x096);
// bitfield macros
#define _IOCB_IOCB0_POSN                                    0x0
#define _IOCB_IOCB0_POSITION                                0x0
#define _IOCB_IOCB0_SIZE                                    0x1
#define _IOCB_IOCB0_LENGTH                                  0x1
#define _IOCB_IOCB0_MASK                                    0x1
#define _IOCB_IOCB1_POSN                                    0x1
#define _IOCB_IOCB1_POSITION                                0x1
#define _IOCB_IOCB1_SIZE                                    0x1
#define _IOCB_IOCB1_LENGTH                                  0x1
#define _IOCB_IOCB1_MASK                                    0x2
#define _IOCB_IOCB2_POSN                                    0x2
#define _IOCB_IOCB2_POSITION                                0x2
#define _IOCB_IOCB2_SIZE                                    0x1
#define _IOCB_IOCB2_LENGTH                                  0x1
#define _IOCB_IOCB2_MASK                                    0x4
#define _IOCB_IOCB3_POSN                                    0x3
#define _IOCB_IOCB3_POSITION                                0x3
#define _IOCB_IOCB3_SIZE                                    0x1
#define _IOCB_IOCB3_LENGTH                                  0x1
#define _IOCB_IOCB3_MASK                                    0x8
#define _IOCB_IOCB4_POSN                                    0x4
#define _IOCB_IOCB4_POSITION                                0x4
#define _IOCB_IOCB4_SIZE                                    0x1
#define _IOCB_IOCB4_LENGTH                                  0x1
#define _IOCB_IOCB4_MASK                                    0x10
#define _IOCB_IOCB5_POSN                                    0x5
#define _IOCB_IOCB5_POSITION                                0x5
#define _IOCB_IOCB5_SIZE                                    0x1
#define _IOCB_IOCB5_LENGTH                                  0x1
#define _IOCB_IOCB5_MASK                                    0x20
#define _IOCB_IOCB6_POSN                                    0x6
#define _IOCB_IOCB6_POSITION                                0x6
#define _IOCB_IOCB6_SIZE                                    0x1
#define _IOCB_IOCB6_LENGTH                                  0x1
#define _IOCB_IOCB6_MASK                                    0x40
#define _IOCB_IOCB7_POSN                                    0x7
#define _IOCB_IOCB7_POSITION                                0x7
#define _IOCB_IOCB7_SIZE                                    0x1
#define _IOCB_IOCB7_LENGTH                                  0x1
#define _IOCB_IOCB7_MASK                                    0x80

// Register: P1DEL
#define P1DEL P1DEL
extern volatile unsigned char           P1DEL               __at(0x097);
#ifndef _LIB_BUILD
asm("P1DEL equ 097h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned P1DEL                  :8;
    };
} P1DELbits_t;
extern volatile P1DELbits_t P1DELbits __at(0x097);
// bitfield macros
#define _P1DEL_P1DEL_POSN                                   0x0
#define _P1DEL_P1DEL_POSITION                               0x0
#define _P1DEL_P1DEL_SIZE                                   0x8
#define _P1DEL_P1DEL_LENGTH                                 0x8
#define _P1DEL_P1DEL_MASK                                   0xFF

// Register: REFCON
#define REFCON REFCON
extern volatile unsigned char           REFCON              __at(0x09B);
#ifndef _LIB_BUILD
asm("REFCON equ 09Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :4;
        unsigned VRLOEN                 :1;
        unsigned VRHOEN                 :1;
        unsigned VRLEN                  :1;
        unsigned VRHEN                  :1;
    };
} REFCONbits_t;
extern volatile REFCONbits_t REFCONbits __at(0x09B);
// bitfield macros
#define _REFCON_VRLOEN_POSN                                 0x4
#define _REFCON_VRLOEN_POSITION                             0x4
#define _REFCON_VRLOEN_SIZE                                 0x1
#define _REFCON_VRLOEN_LENGTH                               0x1
#define _REFCON_VRLOEN_MASK                                 0x10
#define _REFCON_VRHOEN_POSN                                 0x5
#define _REFCON_VRHOEN_POSITION                             0x5
#define _REFCON_VRHOEN_SIZE                                 0x1
#define _REFCON_VRHOEN_LENGTH                               0x1
#define _REFCON_VRHOEN_MASK                                 0x20
#define _REFCON_VRLEN_POSN                                  0x6
#define _REFCON_VRLEN_POSITION                              0x6
#define _REFCON_VRLEN_SIZE                                  0x1
#define _REFCON_VRLEN_LENGTH                                0x1
#define _REFCON_VRLEN_MASK                                  0x40
#define _REFCON_VRHEN_POSN                                  0x7
#define _REFCON_VRHEN_POSITION                              0x7
#define _REFCON_VRHEN_SIZE                                  0x1
#define _REFCON_VRHEN_LENGTH                                0x1
#define _REFCON_VRHEN_MASK                                  0x80

// Register: LVDCON
#define LVDCON LVDCON
extern volatile unsigned char           LVDCON              __at(0x09C);
#ifndef _LIB_BUILD
asm("LVDCON equ 09Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned LV                     :4;
        unsigned LVDEN                  :1;
        unsigned BGST                   :1;
    };
    struct {
        unsigned LV0                    :1;
        unsigned LV1                    :1;
        unsigned LV2                    :1;
        unsigned LV3                    :1;
    };
} LVDCONbits_t;
extern volatile LVDCONbits_t LVDCONbits __at(0x09C);
// bitfield macros
#define _LVDCON_LV_POSN                                     0x0
#define _LVDCON_LV_POSITION                                 0x0
#define _LVDCON_LV_SIZE                                     0x4
#define _LVDCON_LV_LENGTH                                   0x4
#define _LVDCON_LV_MASK                                     0xF
#define _LVDCON_LVDEN_POSN                                  0x4
#define _LVDCON_LVDEN_POSITION                              0x4
#define _LVDCON_LVDEN_SIZE                                  0x1
#define _LVDCON_LVDEN_LENGTH                                0x1
#define _LVDCON_LVDEN_MASK                                  0x10
#define _LVDCON_BGST_POSN                                   0x5
#define _LVDCON_BGST_POSITION                               0x5
#define _LVDCON_BGST_SIZE                                   0x1
#define _LVDCON_BGST_LENGTH                                 0x1
#define _LVDCON_BGST_MASK                                   0x20
#define _LVDCON_LV0_POSN                                    0x0
#define _LVDCON_LV0_POSITION                                0x0
#define _LVDCON_LV0_SIZE                                    0x1
#define _LVDCON_LV0_LENGTH                                  0x1
#define _LVDCON_LV0_MASK                                    0x1
#define _LVDCON_LV1_POSN                                    0x1
#define _LVDCON_LV1_POSITION                                0x1
#define _LVDCON_LV1_SIZE                                    0x1
#define _LVDCON_LV1_LENGTH                                  0x1
#define _LVDCON_LV1_MASK                                    0x2
#define _LVDCON_LV2_POSN                                    0x2
#define _LVDCON_LV2_POSITION                                0x2
#define _LVDCON_LV2_SIZE                                    0x1
#define _LVDCON_LV2_LENGTH                                  0x1
#define _LVDCON_LV2_MASK                                    0x4
#define _LVDCON_LV3_POSN                                    0x3
#define _LVDCON_LV3_POSITION                                0x3
#define _LVDCON_LV3_SIZE                                    0x1
#define _LVDCON_LV3_LENGTH                                  0x1
#define _LVDCON_LV3_MASK                                    0x8

// Register: ANSEL
#define ANSEL ANSEL
extern volatile unsigned char           ANSEL               __at(0x09D);
#ifndef _LIB_BUILD
asm("ANSEL equ 09Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ANS0                   :1;
        unsigned ANS1                   :1;
        unsigned ANS2                   :1;
        unsigned ANS3                   :1;
        unsigned ANS4                   :1;
        unsigned ANS5                   :1;
    };
} ANSELbits_t;
